# NLS_MESSAGEFORMAT_ALL
# NLS_ENCODING=UNICODE
# JDBC Toolkit Messages Range CDIST2800 to  CDIST2899 

# TRNOTE - Do not translate:  JDBC, SQL, SPL
JDBC_PROPERTIES_NOT_EXIST=CDIST2800E Le fichier de propri\u00e9t\u00e9s JDBC sp\u00e9cifi\u00e9 n''existe pas. Il s''agit du fichier ''{0}'' .
JDBC_CONNECTION_FAILED_ERROR=CDIST2801E Echec de la connexion JDBC. Exception ''{0}'' .
JDBC_CLASS_NAME_NOT_EXIST=CDIST2802E jdbcClassName est requis pour la cr\u00e9ation d''une connexion JDBC.
# TRNOTE - JDBC_CLASS_NAME_NOT_EXIST - Do not translate:  jdbcClassName
JDBC_URL_NOT_EXIST=CDIST2803E jdbcUrl est requis pour la cr\u00e9ation d''une connexion JDBC.
JDBC_RESET_CONNECTION_FAILED=CDIST2804E Echec de la r\u00e9initialisation de la connexion JDBC. Exception : ''{0}'' .
JDBC_STATEMENT_PARAMETER_NOT_EXIST=CDIST2805E L''attribut sp\u00e9cifi\u00e9 dans le param\u00e8tre d''instruction n''existe pas : ''{0}'' .
JDBC_SPL_TYPE_NOT_SUPPORT=CDIST2806E L''op\u00e9rateur ne prend pas en charge ce type de SPL : ''{0}'' 
JDBC_SQL_STATEMENT_NULL=CDIST2807E L''instruction SQL est vide.
JDBC_SQL_EXCEPTION_ERROR=CDIST2808E Une exception SQL s''est produite. Exception ''{0}'' .
JDBC_REC_BOUND_NEG=CDIST2809E La valeur du param\u00e8tre reconnectionBound doit \u00eatre \u00e9gale ou sup\u00e9rieure \u00e0 z\u00e9ro.
JDBC_REC_BOUND_NOT_ALLOWED=CDIST2810E Le param\u00e8tre reconnectionBound s''affiche uniquement lorsque le param\u00e8tre reconnectionPolicy est d\u00e9fini sur BoundedRetry.
# TRNOTE - JDBC_REC_BOUND_NOT_ALLOWED - Do not translate:  reconnectionBound, reconnectionPolicy, BoundedRetry
JDBC_WRONG_CONTROLPORT_TYPE=CDIST2811E Le port de contr\u00f4le doit comporter un attribut de type ''rstring'' mais ''{0}'' a \u00e9t\u00e9 d\u00e9tect\u00e9
# TRNOTE - JDBC_REC_BOUND_NOT_ALLOWED - Do not translate:  rstring
JDBC_ATMOST_TWO_ATTR=CDIST2812E Le port de sortie d''erreur facultatif ne peut pas comporter plus de deux attributs.
JDBC_ATLEAST_ONE_ATTR=CDIST2813E Le port de sortie d''erreur facultatif doit comporter au moins un attribut.
JDBC_ERROR_PORT_FIRST_ATTR_TUPLE=CDIST2814E Le premier attribut du port de sortie d''erreur facultatif doit \u00eatre un bloc de donn\u00e9es. 
JDBC_HASRSATTR_NOT_EXIST=CDIST2815E L''attribut sp\u00e9cifi\u00e9 dans le param\u00e8tre hasResultSetAttr n''existe pas : ''{0}'' .
JDBC_SQLSTATUSATTR_NOT_EXIST=CDIST2816E L''attribut sp\u00e9cifi\u00e9 dans le param\u00e8tre sqlStatusAttr n''existe pas : ''{0}'' 
JDBC_NO_CONSISTENT_REGION=CDIST2817E L''op\u00e9rateur ''{0}'' ne peut pas \u00eatre au d\u00e9but d''une r\u00e9gion coh\u00e9rente.
# TRNOTE - JDBC_NO_CONSISTENT_REGION - Do not translate:  consistent region
JDBC_REC_BOUND_NOT_ZERO=CDIST2818E La valeur de reconnectionBound ''{0}'' doit \u00eatre \u00e9gale ou sup\u00e9rieure \u00e0 z\u00e9ro  
JDBC_REC_BOUND_NOT_SET_RETRY=CDIST2819E reconnectionBound ''{0}'' peut s''afficher uniquement lorsque le param\u00e8tre reconnectionPolicy est d\u00e9fini sur BoundedRetry. 
JDBC_CONNECTION_FAILED_WARNING=CDIST2820W Echec de la connexion JDBC. Exception ''{0}'' .
JDBC_SQL_EXCEPTION_WARNING=CDIST2821W Une exception SQL s''est produite. Exception : ''{0}'' .
JDBC_ATTEMPT_TO_RECONNECT=CDIST2822I Tentative de recr\u00e9ation de la connexion JDBC.
JDBC_CR_CLOSE=CDIST2823I Fermeture de StateHandler.
JDBC_CR_CHECKPOINT=CDIST2824I Point de contr\u00f4le. L''ID du point de contr\u00f4le est ''{0}'' .
JDBC_CR_DRAIN=CDIST2825I Vidange.
JDBC_CR_RESET=CDIST2826I Restauration du point de contr\u00f4le : ''{0}'' 
# TRNOTE - JDBC_CR_RESET - Do not translate:  checkpoint
JDBC_RESET_TO_INITIAL=CDIST2827I Restauration de l''\u00e9tat initial.
JDBC_CR_RETIRE=CDIST2828I Suppression du point de contr\u00f4le.
# TRNOTE - JDBC_CR_RETIRE - Do not translate:  checkpoint

