# NLS_MESSAGEFORMAT_ALL
# NLS_ENCODING=UNICODE
# JDBC Toolkit Messages Range CDIST2800 to  CDIST2899 

# TRNOTE - Do not translate:  JDBC, SQL, SPL
JDBC_PROPERTIES_NOT_EXIST=CDIST2800E O arquivo de propriedades JDBC especificado n\u00e3o existe. O arquivo especificado \u00e9 ''{0}''.
JDBC_CONNECTION_FAILED_ERROR=CDIST2801E A conex\u00e3o JDBC falhou. A exce\u00e7\u00e3o \u00e9 ''{0}''
JDBC_CLASS_NAME_NOT_EXIST=CDIST2802E jdbcClassName \u00e9 necess\u00e1rio para criar uma conex\u00e3o JDBC.
# TRNOTE - JDBC_CLASS_NAME_NOT_EXIST - Do not translate:  jdbcClassName
JDBC_URL_NOT_EXIST=CDIST2803E jdbcUrl \u00e9 necess\u00e1rio para criar uma conex\u00e3o JDBC.
JDBC_RESET_CONNECTION_FAILED=CDIST2804E A reconfigura\u00e7\u00e3o da conex\u00e3o JDBC falhou. A exce\u00e7\u00e3o \u00e9 ''{0}''.
JDBC_STATEMENT_PARAMETER_NOT_EXIST=CDIST2805E O atributo especificado no Par\u00e2metro Statement n\u00e3o existe: ''{0}''.
JDBC_SPL_TYPE_NOT_SUPPORT=CDIST2806E O operador n\u00e3o suporta esse tipo de SPL: ''{0}''
JDBC_SQL_STATEMENT_NULL=CDIST2807E A instru\u00e7\u00e3o SQL est\u00e1 vazia.
JDBC_SQL_EXCEPTION_ERROR=CDIST2808E Ocorreu uma exce\u00e7\u00e3o SQL. A exce\u00e7\u00e3o \u00e9 ''{0}''
JDBC_REC_BOUND_NEG=CDIST2809E O valor do par\u00e2metro reconnectionBound deve ser zero ou maior que zero.
JDBC_REC_BOUND_NOT_ALLOWED=CDIST2810E reconnectionBound aparece somente quando o par\u00e2metro reconnectionPolicy est\u00e1 configurado como BoundedRetry.
# TRNOTE - JDBC_REC_BOUND_NOT_ALLOWED - Do not translate:  reconnectionBound, reconnectionPolicy, BoundedRetry
JDBC_WRONG_CONTROLPORT_TYPE=CDIST2811E A porta de controle deve ter um atributo do tipo ''rstring'', localizado ''{0}''
# TRNOTE - JDBC_REC_BOUND_NOT_ALLOWED - Do not translate:  rstring
JDBC_ATMOST_TWO_ATTR=CDIST2812E A porta de sa\u00edda de erro opcional pode ter um m\u00e1ximo de dois atributos.
JDBC_ATLEAST_ONE_ATTR=CDIST2813E A porta de sa\u00edda de erro opcional deve ter pelo menos um atributo.
JDBC_ERROR_PORT_FIRST_ATTR_TUPLE=CDIST2814E O primeiro atributo na porta de sa\u00edda de erro opcional deve ser uma tupla.

JDBC_HASRSATTR_NOT_EXIST=CDIST2815E O atributo especificado no par\u00e2metro hasResultSetAttr n\u00e3o existe: ''{0}''.
JDBC_SQLSTATUSATTR_NOT_EXIST=CDIST2816E O atributo especificado no par\u00e2metro sqlStatusAttr n\u00e3o existe: ''{0}''
JDBC_NO_CONSISTENT_REGION=CDIST2817E O operador ''{0}'' n\u00e3o pode ser o in\u00edcio de uma regi\u00e3o consistente.
# TRNOTE - JDBC_NO_CONSISTENT_REGION - Do not translate:  consistent region
JDBC_REC_BOUND_NOT_ZERO=CDIST2818E O valor reconnectionBound {0} deve ser zero ou maior que zero  
JDBC_REC_BOUND_NOT_SET_RETRY=CDIST2819E reconnectionBound {0} pode aparecer somente quando o par\u00e2metro reconnectionPolicy est\u00e1 configurado como BoundedRetry; caso contr\u00e1rio, n\u00e3o pode aparecer. 
JDBC_CONNECTION_FAILED_WARNING=CDIST2820W A conex\u00e3o JDBC falhou. A exce\u00e7\u00e3o \u00e9 ''{0}''
JDBC_SQL_EXCEPTION_WARNING=CDIST2821W Ocorreu uma exce\u00e7\u00e3o SQL. A exce\u00e7\u00e3o \u00e9 ''{0}''.
JDBC_ATTEMPT_TO_RECONNECT=CDIST2822I Tentando recriar conex\u00e3o JDBC.
JDBC_CR_CLOSE=CDIST2823I Fechamento de StateHandler.
JDBC_CR_CHECKPOINT=CDIST2824I Ponto de verifica\u00e7\u00e3o. O ID do ponto de verifica\u00e7\u00e3o \u00e9 ''{0}''.
JDBC_CR_DRAIN=CDIST2825I Drenar.
JDBC_CR_RESET=CDIST2826I Reconfigurar para o ponto de verifica\u00e7\u00e3o : ''{0}'' 
# TRNOTE - JDBC_CR_RESET - Do not translate:  checkpoint
JDBC_RESET_TO_INITIAL=CDIST2827I Reconfigurar para estado inicial.
JDBC_CR_RETIRE=CDIST2828I Desativar ponto de verifica\u00e7\u00e3o.
# TRNOTE - JDBC_CR_RETIRE - Do not translate:  checkpoint

