# NLS_MESSAGEFORMAT_ALL
# NLS_ENCODING=UNICODE
# JDBC Toolkit Messages Range CDIST2800 to  CDIST2899 

# TRNOTE - Do not translate:  JDBC, SQL, SPL
JDBC_PROPERTIES_NOT_EXIST=CDIST2800E Il file delle propriet\u00e0 JDBC specificato non esiste. Il file specificato \u00e8 ''{0}'' .
JDBC_CONNECTION_FAILED_ERROR=CDIST2801E Connessione JDBC non riuscita. L''eccezione \u00e8 ''{0}'' 
JDBC_CLASS_NAME_NOT_EXIST=CDIST2802E jdbcClassName \u00e8 richiesto per creare la connessione JDBC.
# TRNOTE - JDBC_CLASS_NAME_NOT_EXIST - Do not translate:  jdbcClassName
JDBC_URL_NOT_EXIST=CDIST2803E jdbcUrl \u00e8 richiesto per creare la connessione JDBC.
JDBC_RESET_CONNECTION_FAILED=CDIST2804E Reimpostazione della connessione JDBC non riuscita. L''eccezione \u00e8 ''{0}'' .
JDBC_STATEMENT_PARAMETER_NOT_EXIST=CDIST2805E L''attributo specificato nel parametro dell''istruzione non esiste: ''{0}'' .
JDBC_SPL_TYPE_NOT_SUPPORT=CDIST2806E L''operatore non supporta questo tipo SPL: ''{0}'' 
JDBC_SQL_STATEMENT_NULL=CDIST2807E L''istruzione SQL \u00e8 vuota.
JDBC_SQL_EXCEPTION_ERROR=CDIST2808E Si \u00e8 verificata un''eccezione SQL. L''eccezione \u00e8 ''{0}'' 
JDBC_REC_BOUND_NEG=CDIST2809E Il valore del parametro reconnectionBound deve essere maggiore o uguale a zero.
JDBC_REC_BOUND_NOT_ALLOWED=CDIST2810E reconnectionBound \u00e8 presente solo quando il parametro reconnectionPolicy \u00e8 impostato su BoundedRetry.
# TRNOTE - JDBC_REC_BOUND_NOT_ALLOWED - Do not translate:  reconnectionBound, reconnectionPolicy, BoundedRetry
JDBC_WRONG_CONTROLPORT_TYPE=CDIST2811E La porta di controllo deve avere un attributo di tipo ''rstring'', trovato ''{0}'' 
# TRNOTE - JDBC_REC_BOUND_NOT_ALLOWED - Do not translate:  rstring
JDBC_ATMOST_TWO_ATTR=CDIST2812E La porta di output di errore facoltativa non pu\u00f2 avere pi\u00f9 di due attributi.
JDBC_ATLEAST_ONE_ATTR=CDIST2813E La porta di output di errore facoltativa deve avere almeno un attributo.
JDBC_ERROR_PORT_FIRST_ATTR_TUPLE=CDIST2814E Il primo attributo nella porta di output di errore facoltativa deve essere una tupla. 
JDBC_HASRSATTR_NOT_EXIST=CDIST2815E L''attributo specificato nel parametro hasResultSetAttr non esiste: ''{0}'' .
JDBC_SQLSTATUSATTR_NOT_EXIST=CDIST2816E L''attributo specificato nel parametro sqlStatusAttr non esiste: ''{0}'' 
JDBC_NO_CONSISTENT_REGION=CDIST2817E L''operatore ''{0}'' non pu\u00f2 essere l''inizio di una regione congruente.
# TRNOTE - JDBC_NO_CONSISTENT_REGION - Do not translate:  consistent region
JDBC_REC_BOUND_NOT_ZERO=CDIST2818E Il valore di reconnectionBound ''{0}'' deve essere maggiore o uguale a zero  
JDBC_REC_BOUND_NOT_SET_RETRY=CDIST2819E reconnectionBound ''{0}'' pu\u00f2 essere presente solo quando il parametro reconnectionPolicy \u00e8 impostato su BoundedRetry e non pu\u00f2 essere presente negli altri casi. 
JDBC_CONNECTION_FAILED_WARNING=CDIST2820W Connessione JDBC non riuscita. L''eccezione \u00e8 ''{0}'' 
JDBC_SQL_EXCEPTION_WARNING=CDIST2821W Si \u00e8 verificata un''eccezione SQL. L''eccezione \u00e8 ''{0}'' .
JDBC_ATTEMPT_TO_RECONNECT=CDIST2822I Tentativo di ricreare la connessione JDBC.
JDBC_CR_CLOSE=CDIST2823I Chiusura di StateHandler.
JDBC_CR_CHECKPOINT=CDIST2824I Punto di controllo. L''id punto di controllo \u00e8 ''{0}'' .
JDBC_CR_DRAIN=CDIST2825I Svuotamento.
JDBC_CR_RESET=CDIST2826I Reimpostazione al punto di controllo: ''{0}'' 
# TRNOTE - JDBC_CR_RESET - Do not translate:  checkpoint
JDBC_RESET_TO_INITIAL=CDIST2827I Reimpostazione allo stato iniziale.
JDBC_CR_RETIRE=CDIST2828I Disattivazione del punto di controllo.
# TRNOTE - JDBC_CR_RETIRE - Do not translate:  checkpoint

